envs/openfoam/jet_cylinder_2d/fluid-openfoam/system/controlDict_precice
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime   	 1000000;

deltaT          0.0005;

writeControl   none;

writeInterval   1;

purgeWrite      1;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           1;

functions
{
    #includeFunc forceCoeffs
    #includeFunc probes
    #includeFunc flowRateJet1
    #includeFunc flowRateJet2
    #includeFunc preCICE_Adapter 
}


// ************************************************************************* //
